//Условие:
//Да се определи дали цифрите на дадено трицифрено число са подредени във възходящ ред.
//...................................................................................................

#include <iostream>

using namespace std;


int main()
{
	int n, n1, n2, n3;
	//n = n1 n2 n3 (n1, n2, n3 - цифри)

	cin >> n;

	n3 = n % 10; //остатъкът при деление да 10 ни дава последната цифра
	n /= 10;     //целочислено деление -  n става равно на цялата част частното при деление с 10
			     //така в n остават записани само първите му две цифри
	n2 = n % 10; //аналогично, вземаме следващата цифра
	n /= 10;     //в числото ни остава само цифрата му на стотиците

	n1 = n;      //n1 е цифрата на стотиците

	//проверяваме дали цифрите са подредени във възходящ ред
	if( (n1 < n2) && ( n2 < n3)) //сравняваме поотделно първата и втората и втората и третата цифри,
	{                            //тъй като оператор < позволява сравнение на точно 2 числа едновременно
		cout << "Digits are in increasing order." << endl;
	}

	else
	{
		cout << "Digits are NOT in increasing order." << endl;
	}

	return 0;
}
