//Уловие на задачата:
//Да се въведат две цели числа и да се опредили дали първото е делител на второто.
//..........................................................................................................

#include <iostream>

using namespace std;


int main()
{
	int a, b;
	cin >> a >> b;

	if(a % b == 0)                       //оператор "%" връща остатък при деление на две числа;
	{			                        //ако остатъкът е 0, то второто число е делител на първото
		cout << "YES!" << endl;
	}
	else
	{
		cout << "NO!" << endl;
	}
	return 0;
}
