//Условие:
//Да се определи дали точка (x, y)
//лежи в защрихованата област от фигурата във фйла  със задачите

#include <iostream>

using namespace std;


int main()
{
	//допускаме координатите да бъдат реални числа
	//с уговорката, че операторите за сравнение
	//не са напълно точни в някои гранични случаи, когато работят с дробни числа
	double x, y;
	cin >> x >> y;

	//точката лежи в защрихованата област, ако лежи в малкия кръг или в големи кръг
	//големият кръг има център (0, 0) и радиус 2
	//малкият кръг има център (0, 3) и радиус 1
	//имаме формулата (x-a)^2 + (y-b)^2 <= r^2

	//точката е в големия кръг, точно когато тази променлива има стойност истина
	bool isInBiggerCircle = (x * x) + (y * y) <= 4;
	//точката е в малкия кръг, точно когато тази променлива има стойност истина
	bool isInSmallerCircle = (x * x) + ((y - 3) * (y - 3)) <= 1;

	if(isInBiggerCircle || isInSmallerCircle)
	{
		cout << "The point is IN the wanted area." << endl;
	}

	else
	{
		cout << "The point is OUTSIDE the wanted area." <<endl;
	}

	return 0;
}
