//Условие:
//Да е определи дали да точка с дадени координати цели числа x и y,
//лежи в кръга, описан от окръжността с център (0,0) и радиус 5.

#include <iostream>

using namespace std;


int main()
{
    int x, y;
    cin >> x >> y;

    //Имаме, че в кръга, описан от окръжност с радиус r и център точка (a, b),
    //лежи всяка точка (x, y), за която е изпълнено неравенството
    //(x-a)^2 + (y - b)^2 <= r^2 .
    //В конкретния случай, a = 0 и b = 0. Проверяваме условието :
    if((x * x) + (y * y) <= 25 )
	{
		cout << "The point is inside the circle." << endl;
	}

	else // в противен случай, точката е извън кръга, описан от съответната окръжност
	{
		cout << "The point is NOT inside the circle." << endl;
	}

	return 0;
}
